ssmax1/rtc_gatekeeper/custom_board/avr/boards.txt
# Custom ATmega328P (8 MHz Internal Clock) using official Arduino Core
# optiboot - make atmega328 AVR_FREQ=8000000L BAUD_RATE=38400 UART=0

atmega328_8mhz.name=ATmega328P (8 MHz Internal Clock)

atmega328_8mhz.upload.tool=arduino:avrdude
atmega328_8mhz.upload.protocol=arduino
atmega328_8mhz.upload.maximum_size=30720
atmega328_8mhz.upload.maximum_data_size=2048
atmega328_8mhz.upload.speed=38400

atmega328_8mhz.bootloader.tool=arduino:avrdude
atmega328_8mhz.bootloader.low_fuses=0xE2
atmega328_8mhz.bootloader.high_fuses=0xDA
atmega328_8mhz.bootloader.extended_fuses=0xFD
atmega328_8mhz.bootloader.unlock_bits=0x3F
atmega328_8mhz.bootloader.lock_bits=0x0F
atmega328_8mhz.bootloader.file=optiboot/optiboot_atmega328_pro_8MHz_38400.hex

atmega328_8mhz.build.mcu=atmega328p
atmega328_8mhz.build.f_cpu=8000000L
atmega328_8mhz.build.board=AVR_UNO
atmega328_8mhz.build.core=arduino:arduino
atmega328_8mhz.build.variant=arduino:standard